; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v6)
		(pred_1 ?v5)
		(pred_4 ?v3)
		(pred_3 ?v3)
		(pred_5 ?v5 ?v3)
		(pred_6)
		(pred_2 ?v5))

   (:action op_3
       :parameters  (?v7 ?v1)
       :precondition (and (not-eq ?v7 ?v1) 
                          (pred_4 ?v7) (pred_4 ?v1) (pred_3 ?v7))
       :effect (and  (pred_3 ?v1)
		     (not (pred_3 ?v7))))


   (:action op_1
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_1 ?v4) (pred_4 ?v2)
			    (pred_5 ?v4 ?v2) (pred_3 ?v2) (pred_6))
       :effect (and (pred_2 ?v4)
		    (not (pred_5 ?v4 ?v2)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_1 ?v4) (pred_4 ?v2)
			    (pred_2 ?v4) (pred_3 ?v2))
       :effect (and (pred_5 ?v4 ?v2)
		    (pred_6)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_05 obj_04 obj_03 
          obj_06 obj_01 obj_02 
)
(:init
(pred_4 obj_05)
(pred_4 obj_04)
(pred_4 obj_03)
(pred_1 obj_06)
(pred_1 obj_01)
(pred_1 obj_02)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(pred_6)
(pred_5 obj_06 obj_04)
(pred_5 obj_01 obj_05)
(pred_5 obj_02 obj_03)
(pred_3 obj_04)
)
(:goal
(and
(pred_5 obj_06 obj_03)
(pred_5 obj_01 obj_05)
(pred_5 obj_02 obj_03)
)
)

(:constraints
  (sometime-before  (pred_5 obj_06 obj_03) (pred_3 obj_05))
)
)

; plan
1. (op_1 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_6)
   added: (pred_2 obj_06)
   goals met: 2 of 3
2. (op_3 obj_04 obj_05)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_05)
   goals met: 2 of 3
3. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_5 obj_06 obj_05) (pred_6)
   goals met: 2 of 3
4. (op_1 obj_01 obj_05)
   deleted: (pred_5 obj_01 obj_05) (pred_6)
   added: (pred_2 obj_01)
   goals met: 1 of 3
5. (op_3 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 1 of 3
6. (op_2 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_5 obj_01 obj_03) (pred_6)
   goals met: 1 of 3
7. (op_3 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 1 of 3
8. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06 obj_05) (pred_6)
   added: (pred_2 obj_06)
   goals met: 1 of 3
9. (op_3 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 1 of 3
10. (op_2 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_5 obj_06 obj_03) (pred_6)
   goals met: 2 of 3
11. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_01 obj_03) (pred_6)
   added: (pred_2 obj_01)
   goals met: 2 of 3
12. (op_3 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 2 of 3
13. (op_2 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_5 obj_01 obj_05) (pred_6)
   goals met: 3 of 3
